Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: Блок radio предоставляет возможность изменять состояние, содержимое и внешний вид радиопереключателей.
en: Use the radio block to control the size, state and appearance of the single radio switch.

source: Задает внешний вид блока. В этом случае выбор радиопереключателя происходит нажатием на кнопку.
en: The type of the radio switch. The user selects the type by pressing the button.

source: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: Используется для выбора радиопереключателя.
en: Use the checked modifier with the true value to select the radio switch.

source: { block : 'radio', mods : { theme : 'islands', size : 'm', checked : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'm', checked : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button', checked : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button', checked : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: { block : 'radio', mods : { theme : 'islands', size : 'm', disabled : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'm', disabled : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button', disabled : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button', disabled : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: { block : 'radio', mods : { theme : 'islands', size : 'm', focused : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'm', focused : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button', focused : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button', focused : true }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: { block : 'radio', mods : { theme : 'islands', size : 'm' }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'm' }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: { block : 'radio', mods : { theme : 'islands', size : 'l' }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'l' }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: { block : 'radio', mods : { theme : 'islands', size : 'l', type : 'button' }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML' }
en: { block : 'radio', mods : { theme : 'islands', size : 'l', type : 'button' }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML' }

source: Определяет уникальное имя радиопереключателя.
en: Specifies the unique name of the radio switch.

source: Определяет значение радиопереключателя, которое будет отправлено на сервер.
en: Specifies the radio switch value to send to the server.

source: Определяет текст подписи к радиопереключателю или текст кнопки, если указан модификатор type в значении button.
en: Specifies the radio switch label or the text on the button if the type modifier with the button value is set to the block.

source: Используется только для радиопереключателей с модификатором type в значении button.
en: Use this field only for radio switches with the type modifier set to button.

source: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 'BEMHTML', text : 'twitter', title : 'Кнопка выбора социальной сети', icon : { block : 'icon', mods : { social : 'twitter' } } }
en: { block : 'radio', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 'BEMHTML', text : 'twitter', title : 'Share in Twitter', icon : { block : 'icon', mods : { social : 'twitter' } } }

source: { block : 'radio', mods : { theme : 'islands', size : 'm' }, name : 'radio-islands', val : 'BEMHTML', text : 'Использовать BEMHTML', tabIndex : 3 }
en: { block : 'radio', mods : { theme : 'islands', size : 'm' }, name : 'radio-islands', val : 'BEMHTML', text : 'Use BEMHTML', tabIndex : 3 }

source: Используется для создания различных типов меню.
en: Use this block for creating different types of menu.

source: Тип меню.
en: The type of the menu.

source: Массив пунктов меню.
en: The array of the menu items.

source: Элементы блока
en: Elements of the block

source: Элемент
en: Element

source: Визуальная группировка пунктов меню.
en: The menu items visual grouping.

source: Специализированные поля элементов блока
en: Custom fields of the block elements

source: Заголовок группы пунктов.
en: The name of the menu items group.

source: Блок предоставляет возможность изменять внешний вид меню и управлять поведением вложенных независимых блоков – пунктов меню.
en: Use the menu block to control the state, behavior and appearance of the menu and its nested components – the menu-item blocks.

source: Реализация блока поддерживает клавиатурное управление: если блок menu находится в фокусе (установлен модификатор focused в значении true), ввод с клавиатуры одного из названий пунктов меню автоматически переводит фокус на данный пункт. Выбор происходит нажатием на кнопку Пробел или Ввод.
en: The block supports key-pad control. If menu block is in focus (focused modifier with true value), type a menu item name on your keyboard to switch to the menu item. Use Space bar or Enter buttons to select the menu item.

source: В зависимости от выбранного значения модификатора mode доступны следующие типы блока:
en: The mode modifier changes the type of the block depending on the selected value:

source: простой список (модификатор mode не установлен);
en: basic list (mode modifier is not specified);

source: меню с множественным выбором (модификатор mode в значении check);
en: multiple-choice list (mode modifier with check valu);

source: меню с одиночным обязательным выбором (модификатор mode в значении radio);
en: mandatory single-choice list (mode modifier with radio value);

source: меню с одиночным необязательным выбором (модификатор mode в значении radio-check).
en: optional single-choice list (mode modifier with radio-check value).

source: Простой список (модификатор mode не установлен)
en: Basic list (mode modifier is not specified)

source: Без указания модификатора mode создается простой список без возможности выбрать пункт.
en: If the mode modifier is not set to the block, the basic list without the possibility to select the menu item is created.

source: { block : 'menu', mods : { theme : 'islands', size : 'm' }, content : [ { block : 'menu-item', val : 1, content : 'Море' }, { block : 'menu-item', val : 2, content : 'Горы' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm' }, content : [ { block : 'menu-item', val : 1, content : 'Swimming' }, { block : 'menu-item', val : 2, content : 'Skiing' } ] }

source: Меню с множественным выбором (модификатор mode в значении check)
en: Multiple-choice list (mode modifier with check value)

source: Позволяет выбрать произвольное количество пунктов меню.
en: Use this modifier to create the menu with the possibility to select any number of menu items.

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'check' }, val : [1, 3], content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' }, { block : 'menu-item', val : 3, content : 'Отдых на даче' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'check' }, val : [1, 3], content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' }, { block : 'menu-item', val : 3, content : 'Downshifting' } ] }

source: Меню с одиночным обязательным выбором (модификатор mode в значении radio)
en: Mandatory single-choice list (mode modifier with radio value)

source: Позволяет создать меню, в котором обязательно выбран ровно один пункт.
en: Use this modifier to create the menu that has one mandatory selected item.

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio' }, content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio' }, content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: Меню с одиночным необязательным выбором (модификатор mode в значении radio-check)
en: Optional single-choice list (mode modifier with radio-check value)

source: Модификатор mode в значении radio-check, так же как и модификатор mode в значении radio, позволяет выбрать ровно один пункт меню. Принципиальное отличие в том, что в значении radio-check есть возможность оставить меню без выбранных пунктов.
en: Use this modifier to create the menu that has one mandatory selected item like in the mandatory single-choice list. The fundamental difference between these two menu types is that the menu block with the mode modifier with the radio-check value has the opportunity to leave the menu without the selected items..

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio-check' }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio-check' }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: Если блоку menu устанавливается модификатор disabled, то все вложенные в него блоки menu-item также становятся неактивными.
en: If menu block is disabled, all nested menu-item blocks are also disabled.

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio-check', disabled : true }, content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio-check', disabled : true }, content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: Модификатор disabled в значении true может быть выставлен отдельным пунктам меню:
en: The disabled modifier with the true value could be set to a separate menu items:

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio-check' }, val : 2, content : [ { block : 'menu-item', mods : { disabled : true }, val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio-check' }, val : 2, content : [ { block : 'menu-item', mods : { disabled : true }, val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio-check', focused : true }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio-check', focused : true }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: { block : 'menu', mods : { theme : 'islands', mode : 'check', size : 'm' }, val : [1], content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', mode : 'check', size : 'm' }, val : [1], content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: { block : 'menu', mods : { theme : 'islands', mode : 'check', size : 's' }, content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', mode : 'check', size : 's' }, content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: { block : 'menu', mods : { theme : 'islands', mode : 'check', size : 'm' }, val : [2], content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', mode : 'check', size : 'm' }, val : [2], content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'check' }, val : [2], content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'check' }, val : [2], content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: { block : 'menu', mods : { theme : 'islands', mode : 'check', size : 'xl' }, val : [2], content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', mode : 'check', size : 'xl' }, val : [2], content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimmig' } ] }

source: Определяет перечень пунктов меню.
en: Specifies the list of the menu items.

source: { block : 'menu', mods : { theme : 'islands', size : 'm' }, content : [ { block : 'menu-item', val : 1, content : 'Отпуск на работе' }, { block : 'menu-item', val : 2, content : 'Отпуск на диване' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm' }, content : [ { block : 'menu-item', val : 1, content : 'Vacation at work' }, { block : 'menu-item', val : 2, content : 'Vacation on the couch' } ] }

source: Тип: String, Number, Array.
en: Type: String, Number, Array.

source: Выбранный пункт меню. В таком случае используется тип поля String или Number.
en: The selected value from the menu. In this case the field type is String or Number.

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio' }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Отпуск на работе' }, { block : 'menu-item', val : 2, content : 'Отпуск на диване' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio' }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Vacation at work' }, { block : 'menu-item', val : 2, content : 'Vacation on the couch' } ] }

source: Список выбранных пунктов меню, если блоку установлен модификатор mode в значении check. В таком случае используется тип поля Array.
en: The set of selected values from the menu. This case is possible if the block has the mode modifier set to check. The field type is an Array.

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'check' }, val : [1, 2], content : [ { block : 'menu-item', val : 1, content : 'Отдых в горах' }, { block : 'menu-item', val : 2, content : 'Отдых на море' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'check' }, val : [1, 2], content : [ { block : 'menu-item', val : 1, content : 'Skiing' }, { block : 'menu-item', val : 2, content : 'Swimming' } ] }

source: Элемент group
en: group element

source: Служит для визуальной группировки пунктов меню. Не влияет на общую логику выбора пунктов.
en: A visual grouping of the menu items that does not affect the general logic of items selection.

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio' }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Отпуск на работе' }, { elem : 'group', content : [ { block : 'menu-item', val : 2, content : 'Отпуск в горах' }, { block : 'menu-item', val : 3, content : 'Отпуск на море' } ] }, { block : 'menu-item', val : 4, content : 'Отпуск на диване' } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio' }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Vacation at work' }, { elem : 'group', content : [ { block : 'menu-item', val : 2, content : 'Skiing' }, { block : 'menu-item', val : 3, content : 'Swimming' } ] }, { block : 'menu-item', val : 4, content : 'Vacation on the couch' } ] }

source: Специализированное поле title элемента group
en: title field of group element

source: Определяет заголовок группы пунктов.
en: Specifies the title for a group of menu items.

source: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio' }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Работа' }, { elem : 'group', title : 'Активный отдых', content : [ { block : 'menu-item', val : 2, content : 'В горах' }, { block : 'menu-item', val : 3, content : 'На море' } ] } ] }
en: { block : 'menu', mods : { theme : 'islands', size : 'm', mode : 'radio' }, val : 2, content : [ { block : 'menu-item', val : 1, content : 'Work' }, { elem : 'group', title : 'Outdoor activity', content : [ { block : 'menu-item', val : 2, content : 'Skiing' }, { block : 'menu-item', val : 3, content : 'Swimming' } ] } ] }

source: Используется для индикации выполнения какого-либо процесса.
en: Use this block to indicate a progress of some process.

source: Допустимые значение
en: Acceptable values

source: Способ использования
en: Use cases

source: Активация индикатора.
en: Spin activation.

source: Размер индикатора. Используется только с модификатором theme в значении islands.
en: The size of the block. Use sizes only for spin when the theme modifier is set to islands.

source: Блок spin используется для создания индикатора выполнения какого-либо процесса.
en: Use the spin block to indicate the progress of some process (for example, web page downloading process).

source: Способ использования: BEMJSON, JS.
en: Use case: BEMJSON, JS.

source: Делает индикатор видимым.
en: The modifier activates and displays the spin.

source: Допустимые значения для темы islands: 'xs', 's', 'm', 'l', 'xl'.
en: Acceptable values for the islands theme: 'xs', 's', 'm', 'l', 'xl'.

source: Используется для создания индикации степени выполнения какого-либо процесса.
en: Use this block for displaying a progress status of a process.

source: Степень выполнения процесса в процентах.
en: The status of the process progress (in percent).

source: Блок progressbar – индикатор процесса. Принципиально отличается от блока spin тем, что показывает степень выполнения (прогресс) какого-то процесса.
en: Use the progressbar block to display the progress of some process. The fundamental difference from the spin block is that the progressbar shows a status of the process progress

source: По умолчанию блок занимает всю ширину родителя.
en: By default, the block fits the whole width of the parental block.

source: Определяет степень выполнения процесса в процентах относительно родителя. При отсутствии этого поля степень выполнения равна нулю.
en: Defines the percentage of the process progress, relative to the parent. If the field is omitted, the progress percentage has a zero value.

source: Используется для создания различных типов ссылок.
en: Use this block for creating different types of links.

source: Псевдоссылка.
en: Pseudo link.

source: Размер блока. Используется только с модификатором theme в значении islands.
en: The size of the link. Use sizes only for links when theme modifier is set to islands.

source: Адрес ссылки.
en: Link address.

source: Поведение ссылки.
en: Link behavior.

source: Блок link предоставляет возможность изменять состояние ссылок, их поведение и внешний вид.
en: Use the link block control the size, state, and appearance of the links.

source: Модификатор pseudo
en: pseudo modifier

source: Отличается от обычной ссылки тем, что при клике по ссылке переход на новую страницу не осуществляется.
en: Use to create the link that does not lead to a new webpage.

source: { block : 'link', mods : { theme : 'islands', size : 'm', pseudo : true }, content : 'Показать ответ' }
en: { block : 'link', mods : { theme : 'islands', size : 'm', pseudo : true }, content : 'Show the answer' }

source: Допустимое значение: true
en: Acceptable value: true

source: Определяет адрес, по которому осуществляется переход при нажатии на ссылку.
en: Specifies the link address that will be opened by clicking the link.

source: { block : 'link', mods : { theme : 'islands', size : 'm', pseudo : true }, content : 'Показать ответ', title : 'Нажмите на ссылку для получения ответа.' }
en: { block : 'link', mods : { theme : 'islands', size : 'm', pseudo : true }, content : 'Показать ответ', title : 'Click the link to see the answer.' }

source: Поле target
en: target field

source: Определяет поведение ссылки. Принимает все допустимые значения HTML-атрибута target: _blank, _self (используется по умолчанию), _parent, _top.
en: The field supports all HTML attribute values of the target: _blank, _self (default), _parent, _top.

source: Используется для формирования на странице нескольких слоев блоков, располагающихся друг над другом.
en: Use this block for creating several layers of the blocks that are located one above the other on a page.

source: Целое число от 0 до 9
en: Integer number from 0 to 9

source: Уровень слоя.
en: The layer level.

source: Блок z-index-group располагает блоки слоями друг над другом. Их размещением по z-оси управляет модификатор level.
en: Use the z-index-group block to place the blocks in layers one above the others. The level modifier controls the block layer position on z-axis.

source: Модификатор level
en: level modifier

source: Допустимые значения: целые числа от 0 до 9.
en: Acceptable values: integer number from 0 to 9.

source: Определяет уровень слоя блока относительно других слоев блоков на странице.
en: The level of the popup layer based on the z-index-group block.

source: Чем больше значение модификатора level, тем выше находится слой. При равных значениях level на переднем плане находится тот слой, который в BEMJSON задекларирован позже.
en: The block with the larger level, value covers the block with the lower one. If two blocks have the same level value, the block that is declared in BEMJSON later will cover the other one.
